<template>
  <div class="agreement">
    <van-popup v-model="show" position="bottom">
      <van-nav-bar
        title="用户服务协议"
        left-text="返回"
        left-arrow
        fixed
        @click-left="onClickLeft"
      />
      <div class="content-wrapper pd-cell">
        <p>
          本网站（<span style="color: rgb(24, 144, 255);"
            ><a href="http://www.deepexi.com/">deepexi.com</a></span
          >，以下简称“DEEPEXI”）系北京滴普科技有限公司（以下简称“滴普”）运营，用户（以下简称“您”）可自愿选择滴普提供的产品或服务。
        </p>
        <p>
          请您认真阅读本服务条款，一旦您完成注册或选择DEEPEXI的产品或服务，表示您已充分阅读、理解并接受本服务条款全部内容。
        </p>
        <p><strong>1、总则</strong></p>
        <p>
          1.1&nbsp;滴普向您提供DEEPEXI所展示的产品或服务，并将不断更新、提升产品或服务内容。产品或服务以DEEPEXI公布的相关产品或服务介绍的页面展示以及实际提供为准。
        </p>
        <p>
          1.2&nbsp;滴普有权随时对本服务条款及相应的规则内容进行单方面的变更或调整，并有权以消息推送、网页公告等方式予以公布，而无需另行单独通知您；若您在本服务条款内容及相应的服务规则变更后仍继续使用滴普提供的产品或服务的，表示您接受修改后的内容；若您不同意修改后的服务条款，您应立即停止使用滴普提供的相关产品或服务。
        </p>
        <p><strong>2、账户</strong></p>
        <p><strong>2.1&nbsp;账户注册</strong></p>
        <p>
          2.1.1&nbsp;凡具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织，均可注册DEEPEXI账户，成为DEEPEXI用户。
        </p>
        <p>
          2.1.2&nbsp;在您按照注册页面提示的填写信息、阅读并同意本服务条款且完成全部注册程序后，您将获得相应地DEEPEXI账户，并受本服务条款约束。
        </p>
        <p>
          2.1.3&nbsp;请您务必妥善保管您的DEEPEXI账户及密码。您的DEEPEXI账户是您在DEEPEXI进行一切活动的唯一身份识别依据，凡通过您的账户及密码登录，在该账户下的一切操作及从事的行为，均视为您本人或经授权的行为，由此产生的全部后果及责任将由您承担。
        </p>
        <p>
          2.1.4&nbsp;您了解并同意，为保证账户和交易安全，DEEPEXI有权随时要求您完善DEEPEXI账户信息或（和）进行实名认证。
        </p>
        <p><strong>2.2&nbsp;账户信息</strong></p>
        <p>
          2.2.1您保证向DEEPEXI提供的注册信息真实、准确、完整，若因您提供的注册信息不真实、不准确、不完整，导致您不能享受滴普提供的产品或服务，或给您造成损失的，滴普及DEEPEXI对此不承担任何责任，您将自行承担因此产生的全部直接或间接损失及不利后果。
        </p>
        <p>
          2.2.2&nbsp;您了解并同意，一旦您注册DEEPEXI账户，即视为你同意滴普或DEEPEXI向您提供的通讯地址推送滴普的相关产品或服务信息。
        </p>
        <p>
          2.2.3&nbsp;滴普对您的账户信息负有保密义务，未经您同意，滴普不得将您的账户信息披露、泄露给第三方。
        </p>
        <p><strong>2.3&nbsp;账户注销</strong></p>
        <p>
          2.3.1&nbsp;滴普及DEEPEXI保留在您违反国家相关法律法规规定或违反本服务条款的情况下，中止或终止为您提供部分或全部服务、直至注销DEEPEXI账户的权利。
        </p>
        <p>
          2.3.2&nbsp;若您在DEEPEXI从事侵犯他人合法权益，或从事任何损害/影响或可能损害/影响滴普/DEEPEXI合法权益或良好商誉的行为，滴普有权对您的账户全部或部分功能进行限制，并通知您限期纠正，情节严重的，滴普有权注销您的账户，并停止向您提供产品或服务。
        </p>
        <p><strong>3</strong>、<strong>DEEPEXI产品或服务</strong></p>
        <p>
          3.1&nbsp;滴普通过DEEPEXI及时发布产品或服务相关信息及介绍，并不断更新、升级产品或服务，具体产品或服务相关信息请以DEEPEXI发布信息为准。
        </p>
        <p>
          3.2&nbsp;滴普考虑用户需求及公司经营决策等因素，提供部分产品或服务无偿供用户使用，具体以DEEPEXI发布的信息为准。但滴普有权对上述产品或服务以及无偿服务期限等作出解释、调整。
        </p>
        <p>
          3.3&nbsp;如果您通过DEEPEXI获取或使用来自第三方的任何产品或服务，您还可能受限于该等第三方的相关条款和条件，滴普/DEEPEXI对此不承担任何责任和义务，本服务条款不影响您与该第三方的法律关系。
        </p>
        <p><strong>4、您的权利和义务</strong></p>
        <p>
          4.1&nbsp;您有权决定是否选择并享受滴普提供的产品或服务，有权在接受滴普提供的产品或服务时获得滴普提供的相关技术支持、咨询等服务。
        </p>
        <p>
          4.2&nbsp;您须尊重滴普及其他第三方的知识产权和其他合法权利，否则，您将对您的侵权行为承担相应的法律责任。
        </p>
        <p>
          4.3&nbsp;您理解并同意，对于滴普提供的产品或服务，您仅享有使用权，无权转让、许可或授权第三方使用，不得通过反向编译、反向工程或以其他任何形式从事损害滴普合法权益的行为。
        </p>
        <p>
          4.4&nbsp;您使用滴普提供的产品或服务时将遵从国家相关法律法规、行业惯例以及社会公共道德，不得利用DEEPEXI或（和）滴普提供的产品或服务从事任何违法或不正当行为，包括但不限于：
        </p>
        <p>
          4.4.1&nbsp;反对宪法所确定的基本原则的，违反法律、法规、政策的任何内容（信息）或行为；
        </p>
        <p>
          4.4.2&nbsp;危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        </p>
        <p>4.4.3&nbsp;煽动民族仇恨、民族歧视、破坏民族团结的；</p>
        <p>
          4.4.4&nbsp;宣传封建迷信和/或淫秽、色情、赌博、暴力、恐怖主义或教唆犯罪的信息；
        </p>
        <p>
          4.4.5侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容。
        </p>
        <p><strong>5、滴普的责任范围及责任限制</strong></p>
        <p>
          5.1&nbsp;滴普仅对滴普提供的产品或服务按照本服务条款或协议约定承担相应的责任，对于DEEPEXI之合作单位提供的产品或服务，由该合作单位自行承担全部法律责任。
        </p>
        <p>
          5.2&nbsp;除本服务条款或滴普与您就某一具体产品或服务另有约定外，在任何情况下，您同意滴普承担的赔偿责任总额不超过向您收取的当次服务费用总额。
        </p>
        <p>
          5.3&nbsp;滴普仅按现有技术提供相应的安全措施保障滴普掌握的信息安全，不丢失，不被滥用和泄露。这些安全措施包括但不限于备份数据和对用户密码加密。尽管有这些安全措施，但滴普不能保证这些信息的绝对安全。
        </p>
        <p>
          5.4&nbsp;您理解并同意，系统可能因下列状况无法正常运作，使您无法使用滴普提供的产品或服务时，滴普不承担损害赔偿责任，该状况包括但不限于：
        </p>
        <p>5.4.1电信设备出现故障不能进行数据传输的；</p>
        <p>
          5.4.2因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成滴普系统障碍不能执行业务的；
        </p>
        <p>
          5.4.3由于黑客攻击、电信部门技术调整或故障、网站升级等原因而造成的服务中断或者延迟；
        </p>
        <p>
          5.4.4滴普需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护的；
        </p>
        <p>5.4.5&nbsp;其他由于非滴普过错或过失导致的系统无法正常运行。</p>
        <p><strong>6、商标及知识产权的保护</strong></p>
        <p>
          6.1&nbsp;除第三方产品或服务外，DEEPEXI所有内容，包括但不限于滴普提供的软件产品、图片、资料、架构、页面设计，均由滴普依法拥有其知识产权。
        </p>
        <p>
          6.2&nbsp;非经滴普同意，任何个人或单位不得擅自使用、修改、复制、公开传播DEEPEXI上的程序或内容。
        </p>
        <p><strong>7、其他条款</strong></p>
        <p>
          7.1&nbsp;本服务条款之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本服务条款产生之争议，均提交北京市朝阳区人民法院解决。
        </p>
        <p>
          7.2
          DEEPEXI公示的各项规则系本服务条款的组成或补充，如有不同理解或不一致，以本服务条款为准。
        </p>
        <p>
          7.3&nbsp;本服务条款的标题仅为行文和方便阅读而设，不具有法律或合同效力。
        </p>
        <p>
          7.4&nbsp;任何单位或个人认为DEEPEXI提供的产品、服务或内容可能涉嫌侵犯其合法权益，应及时向滴普提出书面权利通知，并提供身份证明、权属证明、具体链接（URL）及详细侵权情况证明。滴普在收到上述法律文件后，将会依法尽快移除相关涉嫌侵权的内容。
        </p>
        <p>
          7.5
          DEEPEXI以链接形式推荐其他网站内容时，并非代表滴普/DEEPEXI对相关内容负责以及持有倾向性看法，滴普/DEEPEXI亦不保证从其他网站获取的任何内容、产品、服务或其他材料的真实性、合法性，对于任何因使用或信赖从此类网站或资源上获取的内容、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，滴普/DEEPEXI均不承担责任。
        </p>
        <p>
          7.6&nbsp;如有任何疑问，您可通过在线客服、社区、微信群、以及拨打客服咨询电话等方式随时与我们取得联系进行相关问题的咨询。
        </p>
      </div>
    </van-popup>
  </div>
</template>
<script>
import {NavBar} from 'vant'
export default {
  name: 'Agreement',
  components: {
    'van-nav-bar': NavBar
  },
  props: {
    show: {
      type: Boolean,
      default: false
    }
  },
  data() {
    return {}
  },
  methods: {
    onClickLeft() {
      this.$emit('close')
    }
  }
}
</script>
<style lang="less">
.agreement {
  .content-wrapper {
    margin-top: 100px;
    padding: 0 20px;
    height: 100%;
    overflow-y: auto;
  }

  .van-popup {
    height: 100%;
  }
}
</style>
